In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
dframe = DataFrame({'k1':['x', 'x', 'y','y', 'z'],
                   'k2':['alpha', 'beta', 'alpha', 'beta', 'alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2': np.random.randn(5)})

In [3]:
dframe

  k1     k2  dataset1  dataset2
0  x  alpha  0.698119 -1.517750
1  x   beta -1.148047  1.312762
2  y  alpha -0.530623 -0.873062
3  y   beta  0.490305 -1.716708
4  z  alpha -1.088414  0.125514

In [4]:
grou1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
grou1

In [6]:
grou1.mean()

k1
x   -0.224964
y   -0.020159
z   -1.088414
Name: dataset1, dtype: float64

In [7]:
citis = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = np.array(['JAN', 'FEB', 'JAN', 'JAN', 'FEB'])

In [9]:
dframe['dataset1'].groupby([citis, month]).mean()

LA  FEB   -1.148047
    JAN   -0.530623
NY  FEB   -1.088414
    JAN    0.594212
Name: dataset1, dtype: float64

In [10]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
x  -0.224964 -0.102494
y  -0.020159 -1.294885
z  -1.088414  0.125514

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
x  alpha  0.698119 -1.517750
   beta  -1.148047  1.312762
y  alpha -0.530623 -0.873062
   beta   0.490305 -1.716708
z  alpha -1.088414  0.125514

In [12]:
datase2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [14]:
datase2_group.mean()

          dataset2
k1 k2
x  alpha -1.517750
   beta   1.312762
y  alpha -0.873062
   beta  -1.716708
z  alpha  0.125514

In [15]:
dframe.groupby(['k1']).size()

k1
x    2
y    2
z    1
dtype: int64

In [16]:
for name, group in dframe.groupby('k1'):
    print("This is the {} group".format(name))
    print(group)
    print("\n")

This is the x group
  k1     k2  dataset1  dataset2
0  x  alpha  0.698119 -1.517750
1  x   beta -1.148047  1.312762


This is the y group
  k1     k2  dataset1  dataset2
2  y  alpha -0.530623 -0.873062
3  y   beta  0.490305 -1.716708


This is the z group
  k1     k2  dataset1  dataset2
4  z  alpha -1.088414  0.125514

In [17]:
for (k1, k2), group in dframe.groupby(['k1', 'k2']):
    print("Key1= {} Key2={}".format(k1, k2))
    print(group)
    print("\n")

Key1= x Key2=alpha
  k1     k2  dataset1  dataset2
0  x  alpha  0.698119  -1.51775


Key1= x Key2=beta
  k1    k2  dataset1  dataset2
1  x  beta -1.148047  1.312762


Key1= y Key2=alpha
  k1     k2  dataset1  dataset2
2  y  alpha -0.530623 -0.873062


Key1= y Key2=beta
  k1    k2  dataset1  dataset2
3  y  beta  0.490305 -1.716708


Key1= z Key2=alpha
  k1     k2  dataset1  dataset2
4  z  alpha -1.088414  0.125514

In [18]:
gr = dframe.groupby('k1')

In [19]:
gr.get_group('x')

  k1     k2  dataset1  dataset2
0  x  alpha  0.698119 -1.517750
1  x   beta -1.148047  1.312762

In [20]:
group_dict = dict(list(dframe.groupby('k1')))

In [22]:
group_dict['x']

  k1     k2  dataset1  dataset2
0  x  alpha  0.698119 -1.517750
1  x   beta -1.148047  1.312762

In [24]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [25]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.698119 -1.517750
 1 -1.148047  1.312762
 2 -0.530623 -0.873062
 3  0.490305 -1.716708
 4 -1.088414  0.125514, dtype('O'):   k1     k2
 0  x  alpha
 1  x   beta
 2  y  alpha
 3  y   beta
 4  z  alpha}